let handler = async (m, { conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems })  => m.reply(`
❆╼━━❆ •﹝📜﹞• ❆━━╾❆
*❮ اهلا بك/ي في اوامـر بوت 'رافـايــيـل'🤖❯*

*•∙∙━━╍━━﹝💠﹞━━╍━━∙∙•*
*↵ ❲  قـائـمـة المجموعات ❳ ⬳ ⌝🥏⌞*
*•∙∙━━╍━━﹝💠﹞━━╍━━∙∙•*

*❬🥏❭↜ 〚/منشن〛*
*❬🥏❭↜ 〚/لمنشن〛*
*❬🥏❭↜ 〚/مخفي〛*
*❬🥏❭↜ 〚/الإدارة〛*
*❬🥏❭↜ 〚/جروب〛*
*❬🥏❭↜ 〚/جروبي〛*
*❬🥏❭↜ 〚/ترقیة〛*
*❬🥏❭↜ 〚/خفض〛*
*❬🥏❭↜ 〚/طرد〛*
*❬🥏❭↜ 〚/حذف〛*
*❬🥏❭↜ 〚/انذار〛*
*❬🥏❭↜ 〚/رفع-انذار〛*
*❬🥏❭↜ 〚/الانذارات〛*
*❬🥏❭↜ 〚/تغيرالترحيب〛*
*❬🥏❭↜ 〚/تغيرالوداع〛*
*❬🕹️❭↜ 〚/إكس〛*
*❬🕹️❭↜ 〚/حذفإكس〛*

*•∙∙━━╍━━﹝💠﹞━━╍━━∙∙•*
*↵ ❲  قـائـمـة الـتحـويـل ❳ ⬳ ⌝🎴⌞*
*•∙∙━━╍━━﹝💠﹞━━╍━━∙∙•*

*❬🎴❭↜ 〚/ملصق〛*
*❬🎴❭↜ 〚/حقوق〛*
*❬🎴❭↜ 〚/لفيديو〛*
*❬🎴❭↜ 〚/دائري〛*
*❬🎴❭↜ 〚/لصوت〛*
*❬🎴❭↜ 〚/لصورة〛*
*❬🎴❭↜ 〚/اتتب〛*

*•∙∙━━╍━━﹝💠﹞━━╍━━∙∙•*
*↵ ❲  قـائـمـة الـاداوات ❳ ⬳ ⌝🔧⌞*
*•∙∙━━╍━━﹝💠﹞━━╍━━∙∙•*

*❬🔧❭↜ 〚/خط〛*
*❬🔧❭↜ 〚/باركود〛*
*❬🔧❭↜ 〚/لرابط〛*
*❬🔧❭↜ 〚/انطق〛*
*❬🤞🏻❭↜ 〚/دمج〛*
*❬🔰❭↜ 〚/المزيد〛*
*❬🔄❭↜ 〚/دائم〛*
*❬🧾❭↜ 〚/ترجمة〛*

*•∙∙━━╍━━﹝💠﹞━━╍━━∙∙•*
*↵ ❲  قـائـمـة  التحـمـيل ❳ ⬳ ⌝📥⌞*
*•∙∙━━╍━━﹝💠﹞━━╍━━∙∙•*

*❬📥❭↜ 〚/درایف〛*
*❬📥❭↜ 〚/يوتيوب2〛*

*•∙∙━━╍━━﹝💠﹞━━╍━━∙∙•*
*↵ ❲  قـائـمـة  البـحـث ❳ ⬳ ⌝🔍⌞*
*•∙∙━━╍━━﹝💠﹞━━╍━━∙∙•*

*❬🔍❭↜ 〚/جوجل〛*
*❬🔍❭↜ 〚/يوتيوب〛*
*❬🔍❭↜ 〚/ويكيبيديا〛*

*•∙∙━━╍━━﹝💠﹞━━╍━━∙∙•*
*↵ ❲  قـائـمـة الاعـضــاء ❳ ⬳ ⌝👥⌞*
*•∙∙━━╍━━﹝💠﹞━━╍━━∙∙•*

*❬👤❭↜ 〚/المطور〛*
*❬🖼️❭↜ 〚/بروفایل〛*
*❬👻❭↜ 〚/اختفاء〛*
*❬📝❭↜ 〚/تسجیل〛*
*❬🔗❭↜ 〚/الدعم〛*
*❬📶❭↜ 〚/البنغ〛*
*❬👫🏻❭↜ 〚/طقم〛*

*•∙∙━━╍━━﹝💠﹞━━╍━━∙∙•*

*بــــــℝ𝔸ℙℍ𝔸𝔼𝕃ــــــوت*

❆╼━━❆ •﹝📜﹞• ❆━━╾❆
`.trim())
handler.help = ['allmenu']
handler.tags = ['main']
handler.command = ['list', 'allmenu','المهام','المهمات','ليست','مهام'] 

export default handler
